import type { Notif } from "./types";

export const notifications: Notif[] = [
  {
    id: 1,
    title: "طلب خدمة جديد",
    desc: "يريد محمد أحمد أن تقدم له خدمة تصميم موقع إلكتروني",
    time: "16:24 PM",
    unread: true,
  },
  {
    id: 2,
    title: "طلب خدمة جديد",
    desc: "يريد محمد أحمد أن تقدم له خدمة تصميم موقع إلكتروني",
    time: "16:24 PM",
  },
  {
    id: 3,
    title: "طلب خدمة جديد",
    desc: "يريد محمد أحمد أن تقدم له خدمة تصميم موقع إلكتروني",
    time: "16:24 PM",
  },
  {
    id: 4,
    title: "طلب خدمة جديد",
    desc: "يريد محمد أحمد أن تقدم له خدمة تصميم موقع إلكتروني",
    time: "16:24 PM",
  },
  {
    id: 5,
    title: "طلب خدمة جديد",
    desc: "يريد محمد أحمد أن تقدم له خدمة تصميم موقع إلكتروني",
    time: "16:24 PM",
  },
];
