import { blog } from "@/assets";
import Image from "next/image";
import React from "react";
import SuggestBlogs from "../_components/SuggestBlogs";

const BlogDetailsPage = () => {
  return (
    <section className="pt-10 bg-[#F8FAFF] pb-20">
      <div className="container">
        {/* image */}
        <div className="relative h-[220px] lg:h-[400px]">
          <Image
            src={blog}
            alt="blog image"
            fill
            loading="lazy"
            sizes="100vh"
            className="rounded-xl object-cover"
          />
        </div>
        {/* text */}
        <h3 className="text-2xl md:text-3xl mt-8 md:mt-12 dark-color">{"تقديم خدمات تحويل وصرافة بأعلى الأمان، مع التوسّع المدروس في تقديم حلول مالية مبتكرة."}</h3>
        <p className="dark-color mt-3.5 font-light">{"هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة، لقد تم توليد هذا النص من  توليد هذا النص من مولد النص العربى، هذا النص هو مثال لنص يمكن أن يستبدل في نفس النص من مولد النص العربى، هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة، لقد تم توليد هذا النص من  توليد هذا النص من مولد النص العربى، هذا النص هو مثال لنص يمكن أن يستبدل في نفس النص من مولد النص العربى، هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة، لقد تم توليد هذا النص من  توليد هذا النص من مولد النص العربى، هذا النص هو مثال لنص يمكن أن يستبدل في نفس النص من مولد النص العربى، هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة، لقد تم توليد هذا النص من  توليد هذا النص من مولد النص العربى، هذا النص هو مثال لنص يمكن أن يستبدل في نفس النص من مولد النص العربى، "}</p>
        <h3 className="text-2xl md:text-3xl mt-8 md:mt-12 dark-color">{"تقديم خدمات تحويل وصرافة بأعلى الأمان، مع التوسّع المدروس في تقديم حلول مالية مبتكرة."}</h3>
        <p className="dark-color mt-3.5 font-light">{"هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة، لقد تم توليد هذا النص من  توليد هذا النص من مولد النص العربى، هذا النص هو مثال لنص يمكن أن يستبدل في نفس النص من مولد النص العربى، هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة، لقد تم توليد هذا النص من  توليد هذا النص من مولد النص العربى، هذا النص هو مثال لنص يمكن أن يستبدل في نفس النص من مولد النص العربى، هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة، لقد تم توليد هذا النص من  توليد هذا النص من مولد النص العربى، هذا النص هو مثال لنص يمكن أن يستبدل في نفس النص من مولد النص العربى، هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة، لقد تم توليد هذا النص من  توليد هذا النص من مولد النص العربى، هذا النص هو مثال لنص يمكن أن يستبدل في نفس النص من مولد النص العربى، "}</p>
        <SuggestBlogs />
      </div>
    </section>
  );
};

export default BlogDetailsPage;
